Create Database RpgGame;

Use RpgGame;


/*테이블 생성*/
/*회원*/
Create table 회원(
 회원ID char(10) not null,
 회원이름 Char(10),
 주민번호  int,
 연락처 char(20),
 성별 char(5),
 시 char(10),
 구 char(20),
 동 char(20),
 Primary key(회원ID)
);

/*데이터입력*/
Insert Into 회원 Values('Q-0001','임동균',980906,'01000000036','남','천안시','서북구','두정동');
Insert Into 회원 Values('Q-0002','변진원',981029,'01000000003','남','경기도','남양주시','호평동');
Insert Into 회원 Values('Q-0003','최선규',980711,'01000000065','남','강원도','속초시','금호동');
Insert Into 회원 Values('Q-0004','구병무',990211,'01000000010','남','서울시','동작구','흑석동');
Insert Into 회원 Values('Q-0005','이건희',981129,'01000000064','남','부산시','해운대구','송정동');
Insert Into 회원 Values('Q-0006','김기선',980817,'01000000009','남','경상남도','목포시','원산동');
Insert Into 회원 Values('Q-0007','문제욱',990308,'01000000053','남','경기도','고양시','일산동구');
Insert Into 회원 Values('Q-0008','이민규',980819,'01000000031','남','서울시','마포구','망원동');
Insert Into 회원 Values('Q-0009','조건희',981229,'01000000001','남','전자도','전주시','진북동');
Insert Into 회원 Values('Q-0010','박선우',980606,'01060000000','남','부산시','해운대구','좌1동');

/*실행결과*/
Select *
From 회원;
